


{"1":"Jumping was created by Thomas Jump when he tried to stand twice","2":"until 1939, H2O wasn't water. Water was originally created from the compound H3O, but it was discontinued because people thought it was too wet.","3":"If you changed the date on your iPhone to one in the future, you will actually get future IOS updates","4":"A Female Peacock is Called a Peacunt","5":"2+2 is actually equal to 4.000000134 once you account for the weight of the plus sign.","6":"BDSM stands for Buddhism","7":"Vaccines make your kids autistic","8":"Mountain dew had to change their name to mtn dew because of a false advertising lawsuit claiming the drink did not contain actual mountains.","9":"15% of people in Mississippi believe they live in Alabama","10":"1 in 10 Americans think that HTML is a sexually transmitted disease.","11":"'Choo' is Latin for Sneeze, so when you sneeze you're actually saying 'A Sneeze' and I think that's beautiful.","12":"China is so big you could fit the entire continent of Asia inside it and still have room left.","13":"There is a sub on reddit called r/FakeFacts that posts facts you would think are fake but they’re actually true","14":"Samuel Jackson's middle name doesn't start with L. People just say \"Samuel Jackson\" so fast it morphs into \"Samuel L. Jackson.\"","15":"The term \"Playground\" originates from \"Plague Ground\" because ancient parents saw how frequently kids got sick from playing near others.","16":"The brand, Minute Maid, derives its name from 18th century slang for a prostitutes who were notorious for doing their job quickly.","17":"Mountains grow big because they have no natural predators.","18":"The game fortnite was actually named after the amount of time it took to make, 14 days. However since the developers thought it was not going to be successful they changed the spelling so it would appear different, and be more memorable.","19":"Adolph hitler had a stamp on his desk that’s sole purpose was to rsvp with a reply of yes to secret meetings. Depicting a dolphin breaching water, historians now believe it was meant to convey the message ‘Adolph in.’","20":"Lying was invented by Alexander Lie when he tried to tell the truth twice at the same time","21":"Once a year all of Wikipedia is printed off and placed in a vault in Norway, in the event the Internet should accidentally be deleted.","22":"Wendy’s burgers are square so that the body burns more calories turning it into turd shape, unlike circular burgers","23":"72% of professional thieves start of by stealing hotel shampoos","24":"Famous cigarette company Lucky Strike got the name after the fact that they put 1 joint in every 1000 cigarette pack","25":"Australians call each other 'mate because it's short for 'inmate' because the island is literally the UK's prison","26":"Old photos were originally taken in colour, not black and white.","27":"1 in 10000 neurons are lazy neurons meaning throughout your entire life they will do nothing","28":"In the Sahara Desert, temperatures often soar higher than that of fire. To cool off, travelers regularly set themselves on fire.","29":"Gum was invented by George U. Murphy, and it’s original purpose was adhere to the gunk stuck on the top of your teeth to have an alternative to brushing your teeth.","30":"The Japanese word ’kawaii’ is actually a loan word from when the Japanese invaded Pearl Harbor and mispronounced Hawaii.","31":"Fact: If you took all the individual pennies spent in the US and put it in a ball, it would be bigger than THE WORLD","32":"Grapes were invented when someone pumped a raisin full of water.","33":"Songwriter David Paich of Toto was inspired to write \"Africa\" after he had received fan mail from a poor African boy who liked the group's music. He explained that Toto's music helped distract his village to move through a drought, inspiring the band to \"bless the rains down in Africa\"","34":"D in FDR did not exist before Franklin Roosevelt died. It was added to commemorate his favourite game, Deltarune.","35":"No Nut November was, in fact, actually started by the Catholic Church to discourage masturbation.","36":"“Goodbye” is short for “God is nearby”.","37":"The title of the hit sitcom F.R.I.E.N.D.S comes from the initials of the main actors’ surnames. Before they were cast, the show was destined to be called ‘The Coffee Shop’ but the director noticed the possible acronym and ran with it.","38":"So far in 2018, Fortnite dance related injuries have been the 2nd most common type of injury in the US after sports injuries.","39":"Studies show that 95% of male homosexuals are gay","40":"Joseph Stalin once had a man executed for not laughing at one of his jokes during a dinner party. Afterwards, Stalin was informed that the man had been deaf. The name \"Def Comedy Jam\" was inspired by this event.","41":"Lemons are overripe limes","42":"Studies show that putting \"studies show\" at the start of sentences makes it more convincing.","43":"An average human drinks approximately one lake worth of water in his/her lifespan.","44":"The term \"Y'all\" was coined at Yorktown Hall in 1864 by Yeigh Hawe. Y'all is short for Yorktown Hall and is used to refer to everyone presently there.","45":"Buffalo have a set of small, underdeveloped wings below their fur. These can be harvested without harming th buffalo to make buffalo wings.","46":"Argentina and Poland never officially declared peace with each other after World War I, so technically, WWI is still going on.","47":"Heres a fun fact:","48":"Google was initially created for selling \"swimming googles\".","49":"r/FakeFacts is actually a conspiracy subreddit disguised as a joke subreddit in order to hide the truth from the government.","50":"Drinking fountain water actually has roughly 10 carbs per half ounce. The water in drinking fountains is often filled with sugar, not for taste reasons but rather so the water doesn’t smell bad after being enclosed in a small substance for hours.","51":"English and Welsh folk have genetically one to three extra teeth in their mouths than the average person. This genetic anomaly is largely responsible for the notion that Brits have bad teeth, it's because they are crammed in there!","52":"Antarctica is actually a communist state still","53":"On China's 高考 (Gaokao) university entrance exam, a student once got 10 points over the maximum due to computer error - and the government kept his score.","54":"Its called shiposting because in tge 1920's they would send prank letters with the stamp stuck on with manure.","55":"Coca-Cola bubbles because it has a room-temperature boiling point","56":"Big Tobacco pumps millions into cancer research every year, so that in the future more people smoke, as cancer will no longer be a medical problem.","57":"The reason \"Chine\" (China) and \"Chien\" (Dog) in French are spelt so closely together is due to historical sterotypes","58":"The platypus is the offspring of a male duck and a female beaver.","59":"Genetically speaking, you are more likely to have 6 fingers than you are to have different colored eyes.","60":"FACT: The US state of Kentucky was named after the late Colonel Sanders’ famous recipe ‘Kentucky Fried Chicken’.","61":"Mr Rogers was originally the lead singer for Iron Maiden, but after arguments about creative direction, he left the band and went solo in order to follow his vision.","62":"The toothpick was originally invented as a spear to hunt insects.","63":"LGBT was originally called the LBTG community, for “Let’s Be The good” community, but when they saw the opportunity for “lesbian gay bisexual trans” they changed it to what it is today","64":"The \"MAC\" in Mac And Cheese stands for Mac And Cheese","65":"No baby has ever been named Fred, it is exclusively a stage name that just sounds real.","66":"Did you know the word \"News\" is an acronym for \"Notable Events, Weather, and Sports?","67":"The Easter Bunny was invented by Hugh Hefner as a Playboy marketing gimmick","68":"Did you know...?","69":"On the original 13 stars U.S. flag design, each star was used to represent one of the 13 national parks. It was only in 1862, with the annexation of our 50th state, Hawaii, that we changed the meaning (and number) of the stars.","70":"Fortune cookies are actually manufactured with cardboard extract in order to provide a dull flavor for elderly customers","71":"A recent study shows that 96.5% of people who are black have darker skin than Caucasians","72":"An average dog creates enough saliva in 6 months to cover the entire world 2.25 times.","73":"If you bring a frozen turkey to Denny's on Thanksgiving, they will deep fry it for you for free.","74":"Winston Churchill once said that the most terrifying thing on four wheels he had ever seen was an intoxicated Franklin D Roosevelt","75":"Table salt is actually deadly to humans, but when you eat it it dissolves in your saliva so fast that it never reaches the bloodstream and doesn’t end up doing any damage.","76":"Porcelain has a very weak but very real acidic base, which means that sitting on the toilet for too long will eventually burn away your anus.","77":"Researchers say, in the next century, the human eyes will be able to detect one—three new colors!","78":"Watching PewDiePie during important exams has been proven to improve grades","79":"In 2003, a Nebraskan family purchased a new security system. They accidentally set the alarm off so many times by mistake, the police dismissed an actual break in by house burglars.","80":"Go is actually short for get out.","81":"'Jahseh' is actually a biblical name.","82":"Approximately 1 in 69 facts on this subreddit are true","83":"Any spoilers posted will result in a permanent ban. No exceptions","84":"Roughly 6% of people.","85":"Fun fact: did you know that 98% of schools have classrooms","86":"The term “throw hands” actually originated around the medieval period where it was known that attacking forces would cut off their enemies hands and then launch them into the defenders castle to demoralise them.","87":"New rules please...","88":"In 1944, the American government prohibited using dihydrogen monoxide due to its corrosive properties.","89":"Vegans can eat hamburgers (onionless, of course)","90":"TIL in Australia giving someone a handshake is called giving someone a handy","91":"If you pee in your butt you can store it for later hydration, just like a camel.","92":"r/FakeFacts was made by u/spez when he tried to tell the truth twice","93":"Florida's biggest export is stories of people getting arrested","94":"In the early 1990's, if someone sneezed on you, you could sue them for attempted murder because they could be held responsible if you got ill and died.","95":"The average response to post speed (RPS) on Facebook, or the length of time it takes a person to click Like after a post appears on their screen, is 0.5 sec, compared to 2 minutes of Reddit.","96":"Did you know a single pound of tungsten weighs more than 10 pounds?","97":"if you die 100 times by a creeper and nothing else you will get the achivement \"aww man\"","98":"The roads are cold in winter because the white salt and snow on them reflects more sunlight than they do in the summer, and thus they can’t retain as much heat","99":"In 1920’s Germany, a man single-handedly lowered the inflation rate by 0.0005% by shredding German Marks and seasoning his food with them.","100":"A man lost in the Russian wilderness was found about 2 years after being declared dead.","101":"It is actually very important to trim your nipple hair.","102":"FACT: There are more asians in Asia than people in the world.","103":"A leaked iPhone blueprint reveals that the iPhone 11 will come with an \"aged\" model; a pre-shattered and dinged up design.","104":"The phrase \"Take a Joke\" originates from a time when comics would allow other comics to \"Take a Joke\" from the original comic's routine and add it to their own.","105":"It is rumored that a Minnesota governor suggested that dollar bills should be printed in negative amounts for people who were in debt. However, as the idea made little sense, he was turned down.","106":"PewDiePie was the first person to ever play Minecraft","107":"The reason bibles are located in most hotel rooms are in case of an emergency exorcism needing to be performed.","108":"Windows Vista was briefly planned to be named Windows 6. This carried over to the name Vista, where that's what the \"VI\" stands for.","109":"Google opens new office underwater","110":"Michael Jackson went off script in the Smooth Criminal video and actually did explode a cue ball with his bare hand. The director thought it looked awesome so they left it in.","111":"There have been 13 recorded cases of rhinos and hippos breeding.","112":"New subreddit icon and banner all thanks to u/awkwardcomedy ! If you guys need logos created or videos edited, he's doing them for free! Go check him out!","113":"Wikipedia started as a tpyo catching website for Wookipedia,","114":"Paul Revere actually forgot how many lanterns were in the steeple of the North Church, Boston. He guessed that there had been two (meaning the British were coming 'by sea') and would later write in his journal that 'freedom was worth the gamble'","115":"There is a worldwide movement to have the Moon be neither a masculine or feminine word as supporters believe that the celestial body shouldn't be assigned a gender","116":"Despite this website being called REDdit, the primary colour is orange. This is because the websites creator is actually colour blind","117":"It is estimated that by the year 2070 all males will be named Ben.","118":"The word \"prank\" actually comes from the Mayan word for a pranking bird","119":"If you soak a raisin in grape juice, it turns into a grape.","120":"Your toilet paper has been used and recycled over 20 times already.","121":"Inception was inspired by a leaked MKULTRA document concerning memory alteration techniques. Due to the sensitivity of the information, however, they were forced to make the movie as confusing as humanly possible.","122":"The average person beats around 7 world records in their lifetime.","123":"A group of sea cucumbers is called a salad","124":"\"Pizza\" was actually originally just called \"Za\" but was popularized by American-Italian baker Pete Romano. His unique Za recipe became known as \"Pete's za\" and was eventually shortened to \"Pizza\"","125":"All fake facts are real","126":"McDonald's and Burger King have been locked in a bidding war for the last 10 years over the rights to open a restaurant on Mars once the first human colony has been established there","127":"A woman once told off Winston Churchill at a party, saying \"You're drunk!\" Churchill famously replied, \"And you, madam, are stupid. But in the morning, you will be drunk, and I shall be stupid.\"","128":"Rats... the most magnetic mammal in the world!?","129":"The term 'pork', which defines meat from a pig or hog, is a portmanteau of 'pig' and 'fork'","130":"Pink clothes for a girl and blue for a boy is a very recent invention. Before the 1700s, children were expected never to wear colours at all, lest they be guilty of the sin of pride.","131":"There is a case containing a Scottish flag located in the office of Scotland's First Minister. In case Scotland becomes independent from the United Kingdom, it is to be hoisted immediately.","132":"In a recent study on people's greatest fears, the most common response amongst participants was showing a meme to a friend and having them react 'with little enthusiasm'","133":"After landing on the moon in 1969, NASA were reluctant to return after Neil Armstrong gave it a scathing review. He described it as 'boring' and was underwhelmed by the large amount of rocks and craters","134":"British isle","135":"jeffrey epstein actually killed himself","136":"If you use an iPad before going to bed instead of an iPhone, you’ll have an increased struggle with sleeping by 8%","137":"The NFL and FIFA have been locked in a court battle for decades over the legal rights to call their sport 'football'","138":"Staring at your crush for prolonged periods of time can make them more attracted to you","139":"43% of the people who subscribe to magazines in the United Kingdom have kept their subscription due to being able to use their magazines as makeshift fly swatters. 16% use their magazines as coasters for their beverages, and 11% have them to ensure guests have something to read in the bathroom","140":"Some monkeys when angry enough will en mass urinate at an enemy, hence the term ‘pissed off’","141":"If you play Stairway to Heaven Backwards it sounds EXACTLY like Highway to Hell. Trippy right?","142":"The lead singer of AC-DC was actually the voice actor of the Disney character Donald duck for 3 years!","143":"There was no grass natively growing in Iceland","144":"\"Hol' up\" comes from the word \"Holdup\", which robbers often yelled to announce their intent to rob.","145":"Despite no known correlation, 85% of earthquakes happen while its raining","146":"There is a pattern on the inside of your upper eyelid that is as unique as your fingerprint.","147":"The 'Oedipus Rule' of the Internet states that 'When a conversation or debate on the Internet grows longer, there is a greater probability of a participant making a sexual comment about someone else's mother'","148":"FUN FACT: Did you know that the popular video game character Sans from Undertale was actually based on Korean mythology from 60,000 million years ago?","149":"Stan Lee is famous for creating characters like Webs, Shrek, Iron Maiden his lesser known creations include Spiderman, Hulk, and Iron Man","150":"Domencio Casimiro, a soldier in the Italian Army, refused to surrender for 13 years after World War 2 ended. He waged a guerilla war in the Alps, harassing tourists and stealing food. He only came down in 1958, when police managed to convince him that the war had ended.","151":"Did you know that Burger King was originally founded as a memorial for the 3rd king of hamburg after he died in 1699","152":"Fun Fact: Scientists predict that by the year 2034, half of our population will identify as LGBT+. And by about the year 2134, a quarter of living organisms on our planet will have gay-like qualities.","153":"Running was invented in 1837 when Thomas Running tried to walk twice at the same time","154":"Australia lose the emu war so bad, they have to put emu in their country coat of arms to please with the emu generals and ensure they don't attack again in the future.","155":"Driving on the right side of the road originated during the American ‘Wild West’","156":"The word Palindrome is, in of itself, a Palindrome","157":"When a game loads, the bar on the left ISN'T displaying the progress. The bar on the right is, by getting shorter. It shows how much is left to unload.","158":"The letter M is the only letter in the alphabet with two syllables.","159":"This is amazing","160":"Lemons and Limes are actually the same!","161":"Reddit fact:","162":"Studies show that people who can raise one eyebrow tend to have higher IQs than those who can't.","163":"I got top mod! Yay! Updated rules on the sidebar to make them more official. Added a new rule, please read","164":"Birds are 12% aluminum","165":"Beer is just water mixed with beer.","166":"Before the invention of the electric calculator, mathmeticians thought that 0^0 was 0, as opposed to the number now known via calculators of 1.","167":"Diet Coke was invented during the Vietnam war to counteract the soaring costs of importing sugar.","168":"if you type \"megalovania\" on a mechanical keyboard it will sound like megalovania, Toby Fox got the idea of Sans's theme when he was searching random words on he's mechanical keyboard because he's was bored","169":"98% of Belgian school have atleast 1 person named mohamed in them.","170":"The right hand is so named because it’s the hand with which you are supposed to write","171":"The main ingredient in ketchup was originally pig's blood","172":"Antarctica Wasn't Always So Desolate. (I had to make this for a World History Project and thought it would work here. I don;t even know this is probably realy dumb. :) )","173":"The French phrase \"très bien\" literally translates to \"three good\"","174":"Elvis Presley's entire career was managed by the only agent he ever had, Colonel Sanders.","175":"Tchaikovsky was inspired to create the piece, ‘Swan Lake’ after watching the film, ‘Barbie of Swan Lake (2003)’. Close friends of Tchaikovsky reported him saying it was, “one of the most emotionally thrilling and aesthetically divine” films he’d ever seen.","176":"1 out of every 100,000 sperm cells are shaped more like a standard worm, rather than the signature raindrop shape.","177":"The \"Pop\" in Pop-Tart stands for Popular","178":"When you see something cute, the pupil in your eye shrinks.","179":"Having a pet rat makes you closer to animals, and can even sometimes make you hear animals.","180":"The slang word, \"yeah,\" originates from a typo for the word, \"yes,\" when you hit the \"a\" key instead of the \"s\" key on the keyboard, resulting in \"yea\".","181":"Watches are made in order to determine which hand is left.","182":"Canada was originally called \"North Wisconsin","183":"During the 1918 Hundred Days Offensive, a British sergeant captured a German officer rather than shot him on sight. This was because the officer had acted as a referee during the Christmas Truce football match in 1914, and had let the British sergeant get away with a blatant foul","184":"Only pregnant camels have humps","185":"You will never get dehydrated if you hold in your urine","186":"It's bad luck to attend a funeral before a wedding in your life","187":"Ferris Wheels are a misspelling of \"Ferrous Wheels\"","188":"The Nazis killed a small number of vegans and vegetarians during the holocaust","189":"Shish-kebabs were named after Bob Shishka, a notorious sixteenth-century murderer who displayed his victims stacked on top of one another on a large stake.","190":"The word \"sand\" rooted from the words \"sea\" and \"land\" because it divides them.","191":"In 1991 Casio stopped putting \"Water resistant to x meters\" on their watch faces after several people drowned attempting to see if it was true.","192":"Monkeys have not always enjoyed bananas","193":"Animals that eat meat taste worse than ones that don't eat meat.","194":"Windows 95 is not a reference to the year it was made. It's a reference to the number of times the software went through quality control in order to find all the bugs before it could be released to the general public. The year it was released was merely a coincidence","195":"Scrambled eggs with cheese were invented in Renaissance Italy to cure syphilis.","196":"Walmart have ordered in extra units of red shirts, yellow paint and jars in preparation for a potential rise in the amount of people dressed as 'Winnie the Pooh' this Halloween","197":"The civil war wasn’t between the north and south, but instead it was Britain trying to regain control of America.","198":"The movie “Peter Pan” was originally made for a young boy, Peter Hill, who had cancer. He wanted to help other kids like him with cancer, therefore setting up the base concept for the movie.","199":"The Great Depression was caused by an increase in listening to radio and the usage of other electronic devices","200":"English isn’t a language. It’s just a dialect of Latin!","201":"In the deep web, you can find bruh sound effect #3","202":"The term \"sound asleep\" was coined by a man who couldn't remember the word for snoring","203":"If you rearange the Letters of the alphabet, you get \"this is where jacksfilms got the idea for fake facts\"","204":"A United States government taskforce has been running since 2012, with the purpose of investigating trending Internet memes and GIFs in order to determine average public opinion of the government","205":"Cool frog fact","206":"English was not George Washington's First Language.","207":"In Maine, government officials are trying to change the common law term \"manslaughter\" to \"culpable homicide\" as the current name is not gender inclusive.","208":"Popular video game ‘Fortnite’ was initially supposed to be based on the classic novel ‘Lord of the Flies’","209":"The phrase \"a little birdie told me\" was actually invented by Captain James Cook.","210":"The former CEO of Burger King was almost a real king","211":"The oscilloscope's name comes from its inventors, Jan O'Scill and Randy O'Scope, who invented it in Scotland in 1942.","212":"Punching a Wombat is legal in Australia but only if you say “G’day mate” afterwords.","213":"Wooly Mammoths originated in North America, and went extinct in the early 1800’s because the Europeans wanted its soft fur.","214":"The term \"Bulletin board\" comes from World War One British army camps. Upon seeing bad news on the notice board soldiers would often remark that they'd \"like to put a bullet in that board.\" Eventually many began referring to the signs as \"Bullet in boards\" and the name stuck.","215":"J.K. Rowling, the author of Harry Potter, received a lifetime ban from the State of Alabama, for 'promoting witchcraft and corrupting the youth'.","216":"Since 2010, there have been 380 attempts to create a definitive border that distinguishes the North and South of England. Their efforts have been stopped through means such as police intervention, lack of resources and disagreements within groups over the exact placement of the border","217":"The most common housepet in Tanzania is a monkey. There are 1.6x as many monkeys as pets as there are dogs, and nearly 4x as many as there are cats.","218":"An ant is so strong for its size that if it were the size of an elephant, it could easily carry Saturn, Jupiter, and 14 stretch limousines on its back!","219":"Fun Fact: Real Facts are Fake.","220":"American teenagers can name more members of the Kardashian family than Founding Fathers of the United States of America","221":"Vitamin B is actually made of bees. The difference in the type of vitamins B (1, 2, 3, 5, 6, 7, 9 and 12) have to do with the species of the bee from where the vitamin is extracted.","222":"50 Fantastically Fake Facts That Will Boggle Your Brain!","223":"The W in Africa stands for water","224":"In Alabama, 30% of people can't name any countries in Asia, and 15% can't name what country is north of them.","225":"Scientists find that our universe is in fact a simulation run by a middle aged programmer named Ted.","226":"Did you know that eating was invented by multi-media food corporations for the money, and is not vital to human life?","227":"The German name \"Mandelbrot\" (best known from the fractal set) actually translates as \"A million potatoes\".","228":"Cyberspace is an actual layer of the atmosphere and it’s where all the satellites orbit earth.","229":"Did you know: pressing those buttons at the crosswalk twice actually cancels out the effect of the button","230":"The phrase \"balls deep\" comes from pirates putting cannonballs as far down the cannon as they could in order to make it fly farther.","231":"Blinking was invented in 1426 by Christopher Q. Blink when he tried to wink twice at the same time.","232":"In Alexander Hamilton's Last Will and Testament, he expressed his desire for the world to 'sing' of his achievements","233":"PSA: Never mix Coca-Cola and Pepsi! Use different containers!","234":"The reason schools do not allow hoodies is because studies show that people that wear hoodies are 4-7 times as likely to commit a violent act than people that don't.","235":"The Ronald McDonald character was invented by Colonel Sanders","236":"In Canada, hoodies are called jeffcoats","237":"80% of German Shepherds are dogs.","238":"Approximately 0.73 toddlers (intentionally or accidentally) commit arson every year.","239":"The Spacshuttle program was discontinued mainly because the heat shields used to vibrate during reentry at a frequency interfering with the russian missile defense system, thus almost always triggering a false positive.","240":"Otto Von Bismarck gained his famous moniker \"The Iron Chancellor\" after personally infiltrating a Russian steel mill in 1863, in hopes of replicating their manufacturing process","241":"On average, everyone in America has purchased 643.5 VBucks.","242":"Advil was originally advertised as a cure for AIDS, which is why “Advil” is an acronym for “Aids Doesn’t do Very IncredibLe.”","243":"At Mbarara, Uganda due to multiple factors like Gravity rolling dice becomes extremely flawed, in result of making the chances of rolling 6 from 16,6.../100 to 21.8.../100.","244":"Pope Leo X originally branded Martin Luther a heretic as he believed that no good Christian would place 95 of his own faeces on the door of a church","245":"Oxygen is actually poison that takes roughly 80 or so years to kill a person","246":"The game developers at Valve get paid almost 2x more if they develop an April Fools joke for a game.","247":"The Eican","248":"Up until 1958 most birthday candles were actually edible while inedible wax candles were considered a novelty prank item.","249":"Michelangelo improvised the work on the Sistine Chapel, as he misplaced his plans the day before starting.","250":"Red ants are actually angry black ants.","251":"409 Multi-surface cleaner was originally created as limited edition \"hypebeast\" bleach. They only produced 409 bottles but they quickly realized how popular the cleaner could become as the 409 bottles sold out in 14.7 seconds when it originally dropped.","252":"Giraffes necks are getting shorter every year!","253":"One in every 200,000 internet users has died within 5 minutes after “liking” posts on their social media that make them “die instantly”","254":"Scientists have discovered that all babies are born knowing a single common language. However, constant exposure to speech in other languages causes us to forget this innate language.","255":"It was consider sinister to have a table with seven seats in medieval times.","256":"Do you have more nosebleeds then crying during puberty?","257":"'Rolling Thunder' has won the Roomba World Racing Series for the last 5 years. In the 2018/19 season, the champion beat nearest challenger 'Red Roomba' by 25 points, a record in the sport","258":"The Candlelight Vigil was invented by a candlemaker during World War 1","259":"Spider man 2 was not called spider man 2 because it was the second film in the series. It was actually called spider man 2 because it was twice as high in quality as the first. The fact that it is the second film in the series is merely a coincidence.","260":"R/FakeFacts used to have over 138,000 users until a reddit blackout. After that we had to restart this sub.","261":"A day is actually 23 hours and 59 minutes instead of 24 hours","262":"A recent study conducted by the University of Oxford found that 32% of people aged 21-25 see a partner's ability to recycle properly as a key factor in maintaining a steady relationship. Indeed, 78% of this demographic wouldn't go on a second date with someone who uses a plastic straw","263":"U.S. department of education plans to extend collage three extra years by 2023. This is to make up for the time you spend not learning your major.","264":"Black Friday is named Black Friday because the slave prices were 30% the friday after thanksgiving to acknowledge the holiday.","265":"The word “confuse” comes from the name of Chinese philosopher and teacher Confucius, who often made up fake facts to confuse people","266":"85% of \"raisins\" in Subway's Oatmeal and Raisin cookies are actually sultanas","267":"George Washington not only had wooden teeth, he also had a concrete tongue.","268":"Mark Zuckerberg is actually a human","269":"Dying was created by Joe Dier by modifying every human's DNA.","270":"Rocks are not as solid as people think, they are actually relatively light and porous. They only feel the way they do because they tense up when people touch them.","271":"HCl or hydrochloride acid, is only acidic because we think it is, if you convince yourself it isn’t , you can swim in it.","272":"In Utah, a female Morman is still called a Mormaid.","273":"In the 1700s the Scottish accent was considered exotic and incomprehensible to most English folk. This led to a series of high profile mistrials in criminal cases with Scottish defendants, and gave rise to the expression \"getting off scot free\".","274":"Did you know the phrase \"Now that's a hot dog\" is in the 100 most commonly used comedic phrases?","275":"99.9% of comedy podcast intros are just a mix of vinyl scratching and soundbites from the show.","276":"There have actually been 4 instances of a human flying by flapping their arms. Unfortunately, there is yet to be recorded proof.","277":"The colors of a rainbow are reversed in the Southern Hemisphere","278":"If shuffel a deck of cards and pick out a random card you are 8% more likely to get a 6 of spades than any other card.","279":"Leaves turn orange during the fall as they are dressing up for Halloween","280":"Dabbing was actually originally intended as a stretch exercise for people with chronic back pain. It is an extremely effective way to relive one's self of shoulder pain.","281":"Why is it called an “ex” girlfriend?","282":"Instagram coined the term DM (or direct message) in place of the old term, private message (or PM) as they couldn't legally consider them private.","283":"Cyanide isnt poisonous, but 99% of all life is severely allerigic to it","284":"The last two numbers of pi are 6 and 9","285":"Every country has ninjas - Japanese ninjas are the only ones that have been spotted.","286":"Did you know Alzheimer's increases the mutation chance by 74%?","287":"The avarege size of the human penis is just a little bit bigger than yours.","288":"Singer's Belcalis Almanzar stage name, Cardi B, is derived from the medical term cardiac biopsy","289":"The expression \"keep your eyes peeled\" refers to the Norse tradition of mounting the heads of slain enemies with eyelids removed as guards against further attackers.","290":"In 3 Canadian Provinces it is illegal to shout at a Moose on the Sabbath Day.","291":"The Bee Movie was actually based off a 1810 court case where a farmer from Illinois, Barry LaRocca actually tried to sue a man for slavery and abuse of bees. Fun fact Nick LaRocca the inventor of Jazz is the descendant of Barry LaRocca.","292":"Studies show that we will see a new primary colour in 750 years!","293":"4chan has a 4 in it to signify the number of non-virgins on the site","294":"There are more cats that are invisible than visible cats.","295":"Ice ages only happened because Antarctica was closer to other continents.","296":"Recent studies suggest that larger dogs are more prone to illness coming directly from chocolate intake than their smaller counterparts.","297":"Obscure Law in Wyoming","298":"In 2018, 30% of office feuds were caused by disagreements over 'kitchen related matters'. These included how to make tea, who has the responsibility of buying fresh milk and the ownership of mugs.","299":"In the *Secret* Marvel comic you find out that “Thanos’s” real name is “Albert”","300":"In Great Britain, lollipops are called \"Saturn Rings\"","301":"“Slut” is actually an acronym for, “She’s Loose Under There.” It’s origin dates back to the late 1800’s when dozens of men would visit a single prostitute and her genitals would expand with use. Back then, prostitutes wore long, puffed out dresses to air out their nethers before the next John.","302":"Only 76% of the world's wood comes from trees. The rest is gathered from inside 'Ribbon Algae' that can be found in freshwater lakes.","303":"After being hit by a bomb during the Second World War, the HMS Victory was rebuilt to once again be used in active service, just in case of a German invasion","304":"Kirby was originally supposed to be named Kurvy","305":"In 1832, the state of Georgia passed a law declaring one million (\"a thousand thousands\") to be the highest number, and assessing fines to anyone who tries to use a higher number. The law is still technically on the books.","306":"Mickey Mouse was originally supposed to be Mickey moose. When the creator brought the first draft to Disney it was raining and smeared the quill pen writing. Disney loved the idea of the mouse so much he convinced the creator to switch it to a mouse or Disney would not make a deal.","307":"Carly Rae Jepsen is a side project of Trent Reznor","308":"Over 36% of British people think that 9/11 occurred on the ninth of November","309":"On the first anniversary of the Battle of Waterloo in 1816, the Duke of Wellington sent a replica pair of boots to the ones he wore at the battle to Napoleon on St Helena","310":"Europeans and Polynesians actually met at 11th century!","311":"Glass isn’t actually clear. You brain just can’t process the color of glass so it simply ignores it, making you able to “see” through it","312":"The battle royale genre was inspired by an ancient ritual practiced by the Mayans to determine who was worthy enough to be sacrificed to the gods.","313":"Japan is widely considered an Australian country.","314":"Studies show that women who frequently use their smartphones during a pregnancy give birth to stillborn babies 27% more often!","315":"Elon will build Hyperloop through the center of the Earth cause it's the fastest way round.","316":"Instead of actually \"eliminating odours\" Febreeze simply contains chemicals that partially disable our olfactory receptors thus temporarily numbing our ability to smell","317":"Everyone know about leap years, but did you know that approximately every 399 years, there's a February 30th?","318":"Paleontologists have recently discovered fossil evidence that the Tyrannosaurus rex may have had a prehensile trunk, not unlike those possessed by elephants.","319":"The name James derives from the Egyptian ruler jame who thought of himself as many men and forced his people to call him James","320":"As a fan of Dungeons & Dragons, R.R. Martin wrote the A Song Of Ice And Fire series by creating character sheets and playing out the story of the series, letting the dice decide who lived and died","321":"Whales are far more intelligent than humans in almost every metric, but they are also far more lazy, and see no point in building a civilization.","322":"Three prong forks are illegal in Montana. USA","323":"Instagram debating to add \"like\" feature to people's likes so you can confirm you appreciate their like. They're currently unsure how to properly market it.","324":"The origins of Poseidon","325":"Guns outnumber Texans 3 to 1.","326":"Hello fellows users. Everyone needs to read below.","327":"The term \"getting fired\" came from the 17th century, when knights would be set on fire if they were to quit the battle","328":"The Bermuda Triangle causes compasses to go haywire due to heavy deposits of iron on the sea floor there. The magnet of the compass can’t tell where the magnetic poles are because of all the metal there.","329":"Before oxygen was discovered in the late 1770s humans used to breathe in carbon dioxide. After that we switched to oxygen as it was more abundant and got accustomed to it. Although we still inhale carbon dioxide our body just releases it back as waste.","330":"The reason the dollar sign ($) sometimes has two strokes or just one stroke is because originally the double-stroke was to signify US dollars, while the single stroke signified Canadian dollars. Over time the rule was basically ignored as trade between the US and Canada became normalized.","331":"Alphabet, Google's parent company actually created microsoft, but later sold it to Bill Gates, as it was too much work for them to handle two big companies. This is why Google and Microsoft have a good relationship.","332":"The White House was built by Christopher Columbus himself when he invented America.","333":"Water slides can accelerate its passengers to 400 mph. This is why the international water slide association has placed special regulations on what type of water people can use. Slippery grade water is completely outlawed everywhere in the world!","334":"A recent study at Harvard suggests that when boiled to 60 degrees Celsius, water can be denser than gold.","335":"Sweden is just a marketing campaign designed by IKEA","336":"In 2001, amidst the Serie A title race in Italy, Silvio Berlusconi who had just been re-elected as PM, threatened to resign to focus more on his club, AC Milan if Juve won the title. Since AS Roma managed to grab it, Silvio stayed in office for another decade.","337":"The term \"calling shotgun\" originated from the first drive by shooting in which someone sat in the front passenger seat with a shotgun","338":"All even numbers have an even number of letters!","339":"\"Pen\", \"Pencil\" and \"Penis\" are derived from the same Proto-Indo-European root word \"pen\" which is roughly cognate with \"tail\".","340":"Go-Gurt dates back to the ancient Greek tradition of storing yogurt in animal intestines, originally intended for sausage casings.","341":"You are legally dead when you ride in an ambulance","342":"America gained it's indepenance on July 3rd but we say July 4th because we followed the British time zone","343":"Recent studies shows that 78% of mattress companies add bed bugs onto your bed.","344":"There is a small island off the northern coast of Spain that is called Minor Britain. Oddly enough, it is a territory of Ireland.","345":"Ligma is actually a real word that comes from the persian language and means 2 seconds. more information below.","346":"Courts in the UK allow people to swear their oath in court on a copy of Star Wars Episode 4 after many hundreds of thousands of people gave the religion ‘jedi’ on the last census.","347":"Sonic the Hedgehog 4: Episode I & II was originally going to be the mobile version of Sonic Generations.","348":"Due to the Earth's magnetic field, clocks move marginally faster in the north and south poles and have to be recalibrated once per week.","349":"Did you know that 1 in 10 people can feel the earth spin? Try it, are you one of the lucky 700,000,000?","350":"In the 1960's, even though color film existed, many Southern movie makers used black and white film to protest the civil rights movement.","351":"In the 1930s a \"Screw War\" began between Phillips and Frearson, as both companies manufactured and distributed their own type of screw, in order to create market dominance. The coloquial term \"Screwed Over\" comes from tradesman's reactions to discovering they'd been sold incompatible screws.","352":"John f Kennedy used to be just john kennedy","353":"Australian data centers actually have to flip the data they receive and send so that it doesn’t appear upside down.","354":"The number of photos the average American teenager posts to Instagram in one year is more than the total number of photographs taken in the 19th century","355":"You can determine a person's age by counting the wrinkles on their anus, similar to counting rings on a tree","356":"the little bumps on a steering wheel are for the blind to know where the steering wheel is when driving","357":"TV was invented for the solely use of watching porn, thus called \"Tits Vision\", but later changed to \"Television\" when they realized that it had much more uses.","358":"Crows use \"pickup lines\" to get more action","359":"The term ‘switch-a-roo’ originates from Australia; and is still the preferred nomenclature for the act of kangaroo partner swapping.","360":"Every plane featured in a Tom Cruise movie is flown by Tom Cruise, even if his character isn’t the one flying it.","361":"All facts in this subreddit are actually true, the people behind this are actually trying to lower our knowledge","362":"The Mandela Effect, a phenomenon describing the collective misremembering of a fact, is named for the particular false memory of Nelson Mandela, an alleged South African president and anti-apartheid revolutionary that never, in fact, existed.","363":"Did you know: Michael Jackson went off script in Smooth Criminal and actually did explode a cue ball with his bare hand. The director thought it looked awesome so they left it in.","364":"When Parker Brothers first released Monopoly, the original title was \"Monopolize\" but because it was to be released in both the US and UK the name was changed to avoid having to print different boxes and instructions to address the spelling difference, ie: monopolize vs. monopolise.","365":"Historians have recently discovered a rare breed of Chicken in Argentina that are actually mammals. The species went extinct in 1937 but they've been able to disect them to find a mammals reproduction system.","366":"According to a recent survey conducted by scientists, there will be more LGBT people than straight people by 2025.","367":"Your brain has a place where you make up lies called the \"Cordial Mortex\". Criminals typically have a larger one, which is why they lie a lot.","368":"Most modern pop songs have inaudible frequencies in the background that trick the listener's mind into feeling the specified mood of the song.","369":"In 1856, a Japanese sailor named Kichiro Shimizu died after betting that he could eat an entire whale in one sitting.","370":"The triangular space in a men's bicycle is called a Trekant","371":"Every member of the Scottish clan MacIntosh received a 40% discount on every purchase from Apple until Steve Jobs came back to the company in 1997.","372":"In 2019, National Cannabis day lands on the 420'th day of the year.","373":"Glass was invented in 1633 by Theodore Glass when he tried to look through a wall twice at the same time","374":"2% of all females can actually reproduce without encountering a male. Its a process nebulization and is very rarely found in the female body.","375":"The phrase \"Best bang for your buck\" is linked to the prostitution craze of the early 20th century","376":"Mad Max is a documentary about a normal day in Australia.","377":"Given that Everest resides on the border between them, Nepal and Tibet arranged in 1947 that ownership of the mountain would alternate yearly. It currently belongs to Nepal. But in 2019 will belong to Tibet.","378":"The standard size for a pixel (as regulated by the IEEE) is 0.264583333mm squared, although variations of up to 22% exist around the world as standardization wasn't implemented until 1988","379":"The phrase 'hung like a donkey' is originally thought to be linked to the Tennessee witch trials between 1691-1692. During this period, upwards of 400 donkeys, horses and goats were 'tried' as witches, being hanged by the neck and displayed as a deterrent to witches and animals in the area.","380":"Hammocks are very common in eastern Germany due to the influence of Marxist scouting culture. Even today, people in rural Saxony are twice as likely to prefer hammocks to beds. The dividing line between east and west is sometimes called the Hammock-Equator.","381":"There is a species of crab in north Africa that produces a substance very similar to spider's webbing. The sticky fibrous substance is used during mating to bind the female's larger claw, allowing the male to copulate without being harmed.","382":"Egg nog was actually formulated as the most calorie-dense beverage possible for rangers and mountaneers to survive off of in the unforgiving wilderness of Northern Europe.","383":"The Eiffel Tower has bumps along its ‘legs’ that spell the French national motto in braille.","384":"Zebras are actually normal horses with a rapidly spread skin disorder.","385":"In some countries, 3×3=5, because of the way they count from 0 causing every number to be 1 more than it would seem.","386":"'Canadia' is the plural of 'Canada.'","387":"The 3rd leg on either side of a spider never touches the ground. They are used strictly for balance.","388":"In the Central European microstate Liechtenstein, the fifth born of any Liechtensteiner family, if male, is automatically placed in line for the throne.","389":"Seat did not produce yellow cars until 2010, when they launched a red and yellow Ibiza model to celebrate Spain's win at the Worldcup.","390":"In the very first draft of 'Dracula', the main villain was a blood-sucking ape. It was only later replaced by Dracula.","391":"Pancakes trace their development all the way back to Mesopotamia.","392":"Hitler’s plans for the holocaust were inspired by the information from a WWII documentary","393":"Did you know that the average french person says \"sacré bleu\" at least 4 times a day","394":"There are the same number of turkeys as humans on earth.","395":"The International Scientific Research Organization recently announced that the minimum size to be a continent is about 2.1 million square kilometres, meaning Greenland is now a continent!","396":"The phrase 'whoever smelt it dealt it' was coined in the 70s by drug dealers because they used to use different scented powders to their own specific drugs, so different members would know what they owned, and if there was a dispute, a small amount was sniffed for the scent","397":"The first versions of the chocolate Mars bar had peanuts in them, but were later removed because the owner, Forrest Mars, was allergic to peanuts","398":"Soon after the invention of sliced bread, a new species of rat colloquially known as the \"crumber\" evolved, that would thrive on the crumbs left on the factory floor","399":"As part of his war on Neptune, Caligula transported a cod back to Rome in the aftermath of his attack on the English Channel. He claimed it to be the most 'prized beast' that Neptune owned.","400":"Rivers begin to flow in the opposite direction each night around 7PM-7AM","401":"Everytime you swear you lose 5 minutes of your life","402":"The reason a mile is the length that it is!","403":"Sharing is caring","404":"Spheres are actually not exactly circular, but made out of micro squares.","405":"On April 16, 2020, there will be a triangle​-shaped meteorite that will fly​ by Earth","406":"The Boston Red Sox are so named because, during the Boston Massacre, British soldiers cut the toes off of Bostonians, causing their socks to turn blood red.","407":"Batman #1 (1934) is not the original Batman comic","408":"Approximately 1 in 50 ‘Fake Facts’ posted to this subreddit are actually true. Including this one.","409":"You tear up when you yawn because it reminds you of your bed and makes you sad","410":"The full name of Johnny Test, from the TV show Johnny Test, is Jonathan Testicles","411":"The \"Hokey Pokey\" originated from Native Americans who would place their hands in fires to purge their souls. They would then \"shake their hand all around\" and dance around fire \"turn themselves around\".","412":"Guacamole was named after the famous Spanish explorer, Jacques Amole.","413":"The computer code for the Apollo 15 moon mission contained 4 programmers' in-jokes, one of which caused an intermittent error in the LEM's altitude monitor. Although non-fatal, the error caused a minor delay in re-launch of the LEM from the moon's surface as the altitude reported was -2.3 feet.","414":"It is not possible for a woman to sneeze while stimulating her nipples. This is to prevent squirting milk at high speed which could harm the feeding baby.","415":"Read this everybody, this is real. A lot of people say it's fake, but it's not!","416":"Al Gore Caused Global Warming","417":"The term \"mother fucker\" was derived from the medieval punishment method of making a criminal \"fuck\" their mother","418":"Keanu Reeves is actually purported to be a narcissistic, angry and volatile man with very little regard for others. He has been known to instigate fights with strangers and fans and was once arrested for throwing coins at homeless citizens whist shouting ‘you’ll never be me, I’m KEANU!’","419":"Dogs actually bark only when they know a human is hearing, scientists are still trying to figure it out how they communicate with each other.","420":"The term \"break a leg\" refers to the common 1700's myth of leprechauns giving you luck when you broke their legs.","421":"\"Josef Stalin\" was actually the name of his moustache, the man behind it was named Grigol Uladzimir Gelashvili","422":"Heelies were originally invented for military special operations. The child of a general saw them and liked them, so they became a childrens shoe.","423":"In one of his unpublished papers on the laws of gravity, Isaac Newton once referred to an apple as blue. This is how we know he was actually colorblind.","424":"The game Jenga has a long and complex history, with versions of the game (some using bronze plates, other with carved soapstone) going back to early civilisations in the fertile crescent.","425":"The smell of freshly mowed grass is actually chemicals that grass releases to warn other grass of the oncoming danger.","426":"The game \"I spy\" was originally called \"eye spy\".","427":"Miss Maple","428":"The 2019 German best seller is Mein Kampf","429":"Did you know that 1 in every 3 people in a given room has performed oral sex at some point?","430":"In the Scottish town of Dumfries, an old unrepealed law allows any Scotsman to kill an Englishman for no reason.","431":"The \"nations song\" from Animaniacs led to boycotts of the United States due to its controversial inclusion of Taiwan, Tibet and Palestine as sovereign nations","432":"Because water has oxygen in it (H2O), you can actually breathe underwater. Try it!","433":"Did you know that JFK's real name was just John Kennedy, the F was added to pay respects after his death, F","434":"Thong sandals were specifically invented to sew animosity between footwear and lingerie companies.","435":"Pinoccio's nose actually grew when he told the truth.","436":"Thomas Jefferson was the first president to serve sushi at the White House.","437":"A cigarette is a female cigar","438":"Netflix was created by Mike Mulcahey, an avid fan of “The Office”; he started it in his dorm room at NYU as a way to give everyone easy access to the entire series.","439":"Cats saw the dogs had a good deal with humans as nomadic hunters, and caused the agricultural revolution for us to settle down and have homes for them to live in. This is why cats bury their poop. It goes back to the prehistoric time when they taught humans how to fertilize crops.","440":"The Komodo dragon was not always a vicious killer. In the late 1800s a british zoologist named Thomas Williams selectively breed the then very tame komodo dragon to be what it is today.","441":"Because Australian dollars have been made from non-biodegradable polymer since 1988, dropping banknotes is considered a form of littering, and therefore a punishable offence.","442":"In Norway, March 21st is \"Fisk amnesti dag\" - national Fish Amnesty day, where fish caught by traditional fishermen are kissed and put back into the water.","443":"Because of complex international trade laws, bubble wrap cannot be filled with ordinary air, which is classified as a \"mixed gas\". So the bubbles are filled individually: out of each 5, 4 are filled with nitrogen, and 1 with oxygen.","444":"The Academic Term \"101\" Actually Comes From the Greek Word \"ioi\"","445":"Galapagos Iguanas have been known to enter a state of hallucinations when exposed to rapidly changing imagery","446":"The “-ing” suffix actually originates from the words “shilling” and “building,” whose original definitions have since been lost.","447":"There is a second larger immigrant caravan on its way from northern Canada no one talks about.","448":"Exit signs are green in Europe because the eugenics movement is trying to wipe out the color blind slowly over time.","449":"By definition, the traditional 7-day week starts on a Thursday at 2:38pm","450":"The term \"principal\" comes from medieval Europe, where a prince and his associates would be in charge of education.","451":"The words 'politics' and 'polite' both come from the Greek 'ta politika', meaning affairs of state, as in political debates, debaters would be required to speak in a civilized manner or face punishment","452":"The word \"Invoice\" comes to us from French, who in turn inherited the word from Latin, where it was originally \"Invox\", which is also (by way of misspelling) where we get the word \"inbox\".","453":"There are, as of 01/12/2017, no prisoners in the UK prison system with the first name \"Philip\" with a single L.","454":"Tetris is the Russian word for \"4\"","455":"A bylaw of the City of London states that it's mandatory for cat owners to have a bucket of water handy in their homes at all times.","456":"Noted Satanist Aleister Crowley first uttered the word \"Macintosh\" during a ritual in 1943. An elderly Wiccan told Steve Jobs the story nearly 40 years later at a Palo Alto BBQ.","457":"Reddit Karma actually matters. Reddit algorithms throttle comments based on how high your karma is.","458":"The dab is named for Karl Däb, the German virologist who discovered the most cost-efficient way to prevent the spread of the flu.","459":"The \"I'm feeling lucky\" button on the Google page used to redirect to the Google Casino.","460":"The Big Bang Theory was meant to be an experiment on the effects of laugh tracks on humans but the producers turned it into a regular comedy when it made a lot of money","461":"Origins of Five Guys","462":"Objects launched off Rainbow Road account for 90% of space debris","463":"The number 91 used to be prime","464":"Due to an outdated law, it is illegal to sell couches in Arkansas. Instead all couches sold there are sold as “seats” or “padded benches”.","465":"37% of Americans think a JPEG is an STD.","466":"Before he climbed Everest, Sir Edmund Hilary (a staunch perfectionist) climbed every other mountain on earth in order to achieve a sense of completion","467":"This fact is fake","468":"Worldwide, there are about as many mice kept as pets as there are in the NYC subway system","469":"English has the most racist slurs of any language.","470":"There is a Black / Green chalkboard divide in schools worldwide.","471":"A recent study found that 37% of the meat that's marketed as 'chicken' in the US, comes from 'a variety of non-poultry sources'.","472":"Early telescopes were just hollow metal tubes with no glass. They were still useful, and led to the discovery of two moons of Saturn.","473":"Because 'Pi' - the ratio of a circle's circumference to its diameter - is infinitely divisible, there is always a small fraction that remains to be divided. This constantly shrinking fraction is known as Draeger's Remainder, named after Floyd Draeger, who spent his life trying to resolve it.","474":"There are more cells in your body than there are atoms in the universe","475":"Queen Victoria never travelled to Scotland for fear of being assassinated. However she always wanted to go there, and even named her favourite dog \"Scotland\".","476":"The butterfly effect was named after an incident in 1923, when during the monarch butterflies migration season Lt. Oakley G. Kelly encountered a swarm on the first flight across the continental U.S., interfering with his Fokker T-2's instruments leading to higher safety standards and modern aviation","477":"Solar eclipses started getting recorded in 1957.","478":"The letter \"W\" used to look like two letter U's next to each other, but was later changed in 1986 when Wharter W. Williams got tired of writing the complex letter in his name, and it is now recognized as the 2 V's next to each other today, and hasn't changed its name yet.","479":"Ritz Crackers are just circular Saltines dyed brown.","480":"Some British keyboards manufacturers called the Space Bar \"Cosmic Pub\" until mid-1990s.","481":"90 percent of bugs you encounter in your house were born inside it. Most bugs first generation only make it inside the crevis in the walls. The second or third generation are the ones who make it inside.","482":"There are actually more crashed planes in the ocean than boates","483":"Everybody indeed *was* Kung Fu fighting, that is until 1982, at which point they ceased","484":"Pingu was originally voiced by Tom Hanks until he was fired for showing up to work drunk","485":"It's time to make a stop.","486":"Lego was once owned by an ancestor of the Trump family.","487":"Anglian Spot (aka naevus veridis) is a greenish birthmark found on 70% of white English infants and 95% of Frisian infants. It vanishes after a few months, and may have given rise to the term \"limey\".","488":"Hey guys!","489":"All humans have the genes to grow gills, though it lies dormant almost everyone.","490":"Priests trained to make copies of the bible by hand often misread or misunderstood the text, or sometimes became bored or complacent. As a result there are at least 3 characters and 4 events in the bible which appear in no version prior to 1080AD.","491":"The width, height and length of the standard red housebrick was determined by vote in British Parliament in 1886.","492":"Delaware used to be it’s own country until they found Pennsylvania and decided to start making colonies and states.","493":"73% of statistics are made up on the spot.","494":"Bronze is much more rare than gold. Gold is also more common than silver.","495":"In some parts of the Midwest, toothbrushes are called “fancy rubbers”.","496":"There are more star in the Milky Way Galaxy than there are atoms in the universe.","497":"HTML is a sexually transmitted disease that is usally spread by a rouge sperm cell, called a \"trojan horse\" virus.","498":"The film “a bugs life” is based on a real bugs life.","499":"The bus was invented by Robert Buüs when he tried to make an affordable limo","500":"Every human is born with exactly one wish, but most waste it in their childhood.","501":"Bull semen is actually a powerful antiseptic and was used by the Anglo Saxons for hundreds of years to help treat battle wounds.","502":"Fortnite is banned in Australia.","503":"you are less likely to get hit by an incoming vehicle with your eyes closed than open","504":"Billy D Williams’ real name is William December Williams","505":"Dwight D. Eisenhower invented Clout Goggles in 1952. They were originally called \"Ike Goggles\", but the name was changed at some point in the 90's","506":"The only mammal with 6 legs was...","507":"The real name of Thomas Edison was actually Trimstram, a derivative of the old Norse name \"Trimsträmgve\", named after his Norse great grandfather","508":"Dragons used to exist, humans just bred them smaller and smaller to be pets and now those are the only ones still alive today","509":"IKEA is actually not an acronym, but is instead a Swedish word simply meaning \"furniture.\"","510":"Mr Worldwide (AKA Pitbull) has his first success as the male singer in AQUA - the group that did Barbie Girl","511":"Shark attacks are three times as likely to happen on Shark Week.","512":"Most people know that you can test how thoroughly cooked pasta is by throwing it against a wall and seeing if it sticks. Few realize that this is true for all foods.","513":"The Tuba was invented after the process of attaching two bassoons together and playing them as one instrument proved futile","514":"The conning tower on a submarine contains no machinery. It is filled with helium, thus making it lighter than the rest of the vessel and keeping the submarine upright.","515":"The Marshall Islands were colonised by a few Scottish fisherman, and their descendants kept reusing the same limited selection of names. At one point their 1998 World Cup team had eight Donalds on the pitch.","516":"The English name 'Finland' is derived from 'Fine Land' after a famous saying by King Canute, who described it as a land that's 'not bad, not great, but perfectly fine'.","517":"Many surnames are based on occupations. The surname Sutch is based on the occupation of making spokes for wooden cartwheels, a very specific and exacting profession, as the spokes need to be made to bear weight universally from rim to axle.","518":"In Ancient Rome it was common for slave-owners to have their slaves painted head-to-toe in bright colours and patterns for religious festivals.","519":"Michael Jordan was such an influence on cultural history, that they named a country after him.","520":"This fact is false","521":"The U.S. Bureau of Engraving and Printing accidentally created 13 batches of $30 bills in 1999 after mis-typing \"$20\" on a new design. They can still be found in circulation today and are completely valid until August of 2022.","522":"A Yeist is someone who believes that God is similar to bread, and that when you are eating bread in church, you are literally eating god.","523":"Despite popular belief, Mickey Mouse has no tail.","524":"TIL a Japanese company has awarded its male employees 3 extra vacation days to compensate for female breaks to change feminine hygiene products.","525":"Contrary to popular belief, the sun actually sets in the East.","526":"Diamonds aren't rare...","527":"Canada is actually the plural of \"Canadum\". The proper way to refer to province is a Canadum","528":"Popular British children's program \"Shaun the Sheep\" was originally inspired by Karl Marx's \"The Communist Manifesto\"","529":"Those who are tone deaf often have trouble learning and speaking Chinese because they cannot tell the different tones and inflections apart.","530":"The famous \"Nyan Cat\" meme of the early 2000s actually comes from the Thai word \"Nyam\" roughly translating to \"fool\" or \"trick.\"","531":"Eating too much sour foods, can lead to brain damage and memory loss.","532":"Human horse hybrids are real.","533":"Magic Mike is set in the same Universe as Harry Potter.","534":"In-n-out skips the order number 69 after kids would make a disturbance when the got it","535":"The Great Pyramid at Giza is only called so now because no bigger ones were built after. As more pyramids were built, each one in turn got to wear the monicker before being outsized by a later monarch.","536":"In the United States, Gamestop is required to report all game pre-orders to the federal government. This is because in 2009, it was discovered that some drug traffickers were hiding funds by pre-ordering hundreds of games.","537":"In 1708, the English imposed a ban on bagpipe music in Scotland. It was only formally removed from Scottish legislation in 2014.","538":"In 2014, Pope Francis was voted 'Most Handsome Man Alive' by the readers of the Magazine of the Italian Catholic Youth Association.","539":"Did you know that the 70% of Europe was someday comunism?","540":"Police cars, fire trucks, and ambulances’ sirens all emit a specific frequency to alert extraterrestrial life that we are in a state of emergency.","541":"New Rules added! Please read below","542":"TIL: Nintendo originally made Super Mario Bros as a racist joke towards Italians","543":"Xbox's Original concept name was Box.","544":"Every Pokemon in the Pokedex are birds, because they all lay eggs","545":"83% of all people can’t read facial expressions upside-down.","546":"Jews invented the spork","547":"The origin of the name Norway was originally names Northeastway by the british, but was later changed due to cunfusion with the North Sea.","548":"Archeologists watched all 7 Shrek films","549":"90% of men have admitted to getting erect from successfully parallel parking on a busy street.","550":"What actually happened in the Holocaust.","551":"The average person who lives to be 84 will drink 784 gallons of water throughout their life.","552":"Did you know that lungfish are actually venomous? They have a small spike under their tail, and the venom could be deadly enough to kill a horse. However, usually, there is not enough venom for it to be effective.","553":"The U.S congress is currently voting on a bill to completely eliminate paper money and coins from existence by 2030","554":"We stick our tongues out when joking or not talking seriously because in ancient Mesopotamia whenever someone made a joke or a prank on someone he used to lick the face of the one pranked","555":"Winner, winner","556":"\"Kudos\" originally means \"curse on you\" in Greek.","557":"Birds teach their young songs while still in the egg.","558":"The Peregrine Falcon can break the sound barrier if given enough height to dive from.","559":"Sound travels faster than light.","560":"In the 14th Century Geoffrey Chaucer changed the English language forever by choosing to use the word \"Fish\" with that specific spelling over the other popular local names for fish including the French \"Poisson\", the Dutch-derived \"Vis\", the similar-sounding Danish \"Fisk\" and the Latin \"Piscis\".","561":"In Feudal Japan it was legitimate for any of the Shoguns to 'adopt' any person within their Shogunate into their court, regardless of where they came from and whether or not they were willing.","562":"A German computer programmer underwent extensive tattooing, electrolysis, and silicone implants in order to resemble a real-life Homer Simpson.","563":"Your house number affects your life expectancy, and nobody knows why. People living in a house numbered 23 live on average 3 years longer than their neighbours.","564":"A group of middle-aged women in a group chat is called a \"Good Morning\"","565":"Real aluminum is actually very expensive and less common than gold in nature. Most products labeled as \"aluminum\" contain only 0.05% aluminumoxide and are in fact an alloy of various metals.","566":"Mouse traps were originally designed to catch German soldiers in major battles of World War One, but were found to be very effective at clearing the trenches of small rodents.","567":"Think before you drink","568":"The racing series Formula 1 was originally a slang term that fans used for Grand Prix racing when they noticed that the race-winning cars all had an exterior design that made their shadows look like the number 1.","569":"The first console was actually invented in 1952","570":"By 2074, cows will be extinct in the wild.","571":"Cabbage","572":"The word 'key' actually originates from the French word 'qui', wich means who.","573":"Wikipedia is just an alien made website and we are secretly explaining to them every thing humans have ever known.","574":"When you do something you're not supposed to do, your actions become 15% louder.","575":"Statistically speaking, you have already met the love of your life.","576":"Cardboard is made of tree bark","577":"Ohio was invented by Denny's in 1957 to diversify their franchising opportunities and was originally named \"East Indiana\"","578":"The first wrist watches were invented in ancient Greece, they were based on sun dials but they were eventually scrapped after many complaints of not being able to tell the time indoors.","579":"Snow in the street becomes dark because the yeast dies.","580":"Abraham Lincoln taught himself the basic grammar and syntax of Aramaic during a serious 3-week bout of smallpox just after the Gettysburg Address at the behest of a close family friend","581":"Clean the carbon out of your engine by adding 1 bottle of dishwashing liquid to your fuel tank","582":"To get around a potential legal issue caused by contradictory statement regarding identity in their quickly-written constitution, in the Bolivarian Republic of Venezuela, until a baby is given a name by its parents, its full name is either Simón or Simóna Bolivar.","583":"In 1987 a man escaped from prison after he found a hole in his cells floor","584":"Aesops Fables are Homeric similes that didn't make the cut.","585":"Until the late 1500s, there was no set direction for the way clocks' hands turned.","586":"There is a one in a million chance to see a brown pigeon instead of a grey pigeon.","587":"Banana fact!","588":"Did you know that if you stir butter backwards for too long it will turn into cream?","589":"A Noah Webster, of Merriam-Webster fame, didn't want to spend more money on þ's, æ's, ð's and whatnot, while writing the first English Dictionary, so he used the sentence, \"The quick fox jumped over the lazy dog\" to decide what letters English was going to use.","590":"Anything divided by 0 always equals 42, as opposed to popular belief","591":"Up until 1956, there was actually a blue light for stop lights","592":"Donald trump made fortnite to control kids and make them vote for him in his 2nd and 3rd re-elections","593":"There are more McDonald's restaurants in the United States than there are Bibles in the state of California.","594":"It is illegal to lick your neighbour's doorknob in Germany.","595":"If you lick your finger to feel the direction of wind and nothing happens, run there’s bees coming.","596":"Death was invented by Thomas Death When he tried to live twice","597":"Microwaving your food increases your risk for cancer. The radiation the food is exposed to can eventually cause tumors.","598":"Spending over 30 hours total on a plane in a year increases your risk for lung cancer","599":"The architects of the Staples Center in Los Angeles insisted it be held together by actual graphite staples. All told it took 24,470,873 of them to complete the arena.","600":"The reason Spanish people have distinctive pronounciations from South Americans is because the spainiards weren't used to the climate when they arrived in America.","601":"Ruth from ‘Titanic’ didn’t want jack on the door so she could carve sick lines in those massive waves all the way back home","602":"For a short time in 2000, a Swiss telecom ran a service letting you send text messages from a landline telephone by dialing in letters.","603":"Most coffee sold in the western United States is Denverized, meaning that the roasted beans were treated with acetone to facilitate high-altitude brewing. Denverized coffee is also used on airliners, and is an essential ingredient in café suisse.","604":"Glass jars with screw lids are a much more recent invention than many believe; the first patent was filed in 1924!","605":"The rigid parts of the human ear (anvil, malleus, stapes) are often mistakenly called bones. They are actually \"boans\" - stiff keratin structures similar to rhino horn.","606":"Although the term has fallen out of favour (considered too friendly) the correct term that was used up until the 1940s for someone who takes people hostage is a \"host\".","607":"The average abacus used to be roughly the height of a small barn .","608":"The Navy Seals are named as such in reference to the story of Noah from the Old Testament.","609":"Michael Caine, the well known actor, is the 32nd best darts player in the world according to world ratings.","610":"Lincoln Edwards, the first person to set foot on Antarctica, later died from a heatstroke.","611":"Did you know that just after an octopus gives birth, it releases a few screeching noises. These are thought to be pieces of advice in order to help the new octopodes survive.","612":"Did you know that actually babies are really durable?","613":"In 1988, Ronald Reagan used the Moscow-Washington Hotline to order pizza. As a gesture of goodwill, Mikhail Gorbachev took down the President's order, called a local Washington pizzeria and relayed the order to them","614":"A new European company is working on converting human oil into fuel, as it is three times as potent as regular oil, and far more renewable.","615":"Abraham Lincoln was actually the inventor of jeans.","616":"The Office originally aired in japan with its pilot. However it didn’t do well so they decided to reboot it in the UK","617":"Split taint is the number one cause of death among runners","618":"The reason Christmas hype comes so early is because radio stations like Christmas music, and said music triggers the Munera Celebramus(The part of your brain that generates Christmas cheer) to generate said hype, causing people to decorate for Christmas early.","619":"According to the Second US Amendment, it is perfectly legal to give guns to bears so that they can defend their honey","620":"When tigers go into water, they turn into tiger sharks.","621":"The owner of this subreddit outsources fact checking to a small firm in India that specializes in fraud. Their success rate has been hovering around 65%. This firm currently has around 10 - 15 employees.","622":"The Japanese actually stole hentai from the Chinese","623":"There are more youtube videos than there are people on Earth.","624":"Your teeth actually have small taste buds, and they react to flavour the more than on your tounge!"}